<!-- add-pr-comment:add-pr-comment -->

#### Terraform Plan

<details>
<summary>Show Plan</summary>

```diff
Acquiring state lock. This may take a few moments...
hcloud_ssh_key.default: Refreshing state... [id=10614522]
inwx_domain_contact.default: Refreshing state... [id=192213]
inwx_domain_contact.inwx: Refreshing state... [id=1]
inwx_domain.default: Refreshing state... [id=nobbs.eu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # hcloud_server.workstation will be created
+   resource "hcloud_server" "workstation" {
+       allow_deprecated_images    = false
+       backup_window              = (known after apply)
+       backups                    = false
+       datacenter                 = (known after apply)
+       delete_protection          = false
+       firewall_ids               = (known after apply)
+       id                         = (known after apply)
+       ignore_remote_firewall_ids = false
+       image                      = "ubuntu-22.04"
+       ipv4_address               = (known after apply)
+       ipv6_address               = (known after apply)
+       ipv6_network               = (known after apply)
+       keep_disk                  = false
+       location                   = "nbg1"
+       name                       = "workstation"
+       rebuild_protection         = false
+       server_type                = "cpx21"
+       ssh_keys                   = [
+           "10614522",
        ]
+       status                     = (known after apply)
+       user_data                  = "B4G5TkYFdu+mvvQ01LAikZjjKCc="
    }

  # inwx_nameserver_record.workstation_default_a will be created
+   resource "inwx_nameserver_record" "workstation_default_a" {
+       content = (known after apply)
+       domain  = "nobbs.eu"
+       id      = (known after apply)
+       name    = "workstation"
+       prio    = 0
+       ttl     = 3600
+       type    = "A"
    }

  # inwx_nameserver_record.workstation_default_aaaa will be created
+   resource "inwx_nameserver_record" "workstation_default_aaaa" {
+       content = (known after apply)
+       domain  = "nobbs.eu"
+       id      = (known after apply)
+       name    = "workstation"
+       prio    = 0
+       ttl     = 3600
+       type    = "AAAA"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @nobbs, Action: \`pull_request\`, Workflow: \`Check PR\`*